tungnguyen1610/STM32H745-Dual-Core-Frequency-Meter/CM4/Inc/stm32h7xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32h7xx_hal_conf_template.h
  * @author  MCD Application Team
  * @brief   HAL configuration template file.
  *          This file should be copied to the application folder and renamed
  *          to stm32h7xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef INC_STM32H7XX_HAL_CONF
#define INC_STM32H7XX_HAL_CONF
#ifndef STM32H7xx_HAL_CONF_H
#define STM32H7xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
  * @brief This is the list of modules to be used in the HAL driver
  */
#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_DISABLED
#define HAL_CEC_MODULE_DISABLED
#define HAL_COMP_MODULE_DISABLED
#define HAL_CORDIC_MODULE_DISABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_CRC_MODULE_DISABLED
#define HAL_CRYP_MODULE_DISABLED
#define HAL_DAC_MODULE_DISABLED
#define HAL_DCMI_MODULE_DISABLED
#define HAL_DFSDM_MODULE_DISABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_DMA2D_MODULE_DISABLED
#define HAL_DTS_MODULE_DISABLED
#define HAL_DSI_MODULE_DISABLED
#define HAL_ETH_MODULE_ENABLED
/* #define HAL_ETH_LEGACY_MODULE_DISABLED */
#define HAL_EXTI_MODULE_DISABLED
#define HAL_FDCAN_MODULE_DISABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GFXMMU_MODULE_DISABLED
#define HAL_FMAC_MODULE_DISABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_HASH_MODULE_DISABLED
#define HAL_HCD_MODULE_DISABLED
#define HAL_HRTIM_MODULE_DISABLED
#define HAL_HSEM_MODULE_ENABLED
#define HAL_I2C_MODULE_DISABLED
#define HAL_I2S_MODULE_DISABLED
#define HAL_IRDA_MODULE_DISABLED
#define HAL_IWDG_MODULE_DISABLED
#define HAL_JPEG_MODULE_DISABLED
#define HAL_LPTIM_MODULE_DISABLED
#define HAL_LTDC_MODULE_DISABLED
#define HAL_MDIOS_MODULE_DISABLED
#define HAL_MDMA_MODULE_DISABLED
#define HAL_MMC_MODULE_DISABLED
#define HAL_NAND_MODULE_DISABLED
#define HAL_NOR_MODULE_DISABLED
#define HAL_OPAMP_MODULE_DISABLED
#define HAL_OSPI_MODULE_DISABLED
#define HAL_OTFDEC_MODULE_DISABLED
#define HAL_PCD_MODULE_DISABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_PSSI_MODULE_DISABLED
#define HAL_QSPI_MODULE_DISABLED
#define HAL_RAMECC_MODULE_DISABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_RNG_MODULE_ENABLED
#define HAL_RTC_MODULE_DISABLED
#define HAL_SAI_MODULE_DISABLED
#define HAL_SD_MODULE_DISABLED
#define HAL_SDRAM_MODULE_DISABLED
#define HAL_SMARTCARD_MODULE_DISABLED
#define HAL_SMBUS_MODULE_DISABLED
#define HAL_SPDIFRX_MODULE_DISABLED
#define HAL_SPI_MODULE_DISABLED
#define HAL_SRAM_MODULE_DISABLED
#define HAL_SWPMI_MODULE_DISABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_USART_MODULE_DISABLED
#define HAL_WWDG_MODULE_DISABLED

/* ########################## Oscillator Values adaptation ####################*/
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    (8000000UL) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    (100UL)   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal  oscillator (CSI) default value.
  *        This value is the default CSI value after Reset.
  */
#if !defined  (CSI_VALUE)
  #define CSI_VALUE    (4000000UL) /*!< Value of the Internal oscillator in Hz*/
#endif /* CSI_VALUE */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    (64000000UL) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief External Low Speed oscillator (LSE) value.
  *        This value is used by the UART, RTC HAL module to compute the system frequency
  */
#if !defined  (LSE_VALUE)
  #define LSE_VALUE    (32768UL) /*!< Value of the External oscillator in Hz*/
#endif /* LSE_VALUE */


#if !defined  (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    (5000UL)   /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */

#if !defined  (LSI_VALUE)
  #define LSI_VALUE  (32000UL)              /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */                      /*!< Value of the Internal Low Speed oscillator in Hz
                                              The real value may vary depending on the variations
                                              in voltage and temperature.*/

/**
  * @brief External clock source for I2S peripheral
  *        This value is used by the I2S HAL module to compute the I2S clock source
  *        frequency, this source is inserted directly through I2S_CKIN pad.
  */
#if !defined  (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE    12288000UL /*!< Value of the External clock in Hz*/
#endif /* EXTERNAL_CLOCK_VALUE */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

